
<template>
    <div class="news">
        <div class="first-row">
            <h1 class="h1">Новости компании</h1>
            <p class="p1">Здесь мы публикуем свежие обновления внутри компании</p>
            <h2 class="h2">Новостная колонка “Тепло в тренде: новости из мира котельных”</h2>
            <div class="container"></div>
            <div class="description">
                <p>Горячее предложение от “АО НТЦ Техтелеком-АС” - аренда и продажа мощных котельных! 🔥</p>
                <p>🔧Аренда и продажа котельных от 500 до 3000 кВт</p>
                <p>✔️ Большой парк котельных различной мощности в наличии!!!</p>
                <p>✔️Надежные и энергоэффективные решения для Вашего бизнеса</p>
                <p>✔️Соответствие всем нормам и требованиям</p>
                <p>✔️Индивидуальный подход к каждому клиенту и проекту</p>
                <p>🔥 Успей заказать свою котельную сейчас! ЗИМА БЛИЗКО!!!</p>
                <p>📞Звоните или пишите нам прямо сейчас, чтобы узнать больше!</p>
            </div>
            <div class="more-container">
                <button class="more">Подробнее об установке</button>
            </div>
            <div class="container1"></div>
            <div class="container2"></div>
        </div>
        <div class="second-row">
            <h1 class="h1">Участие в программе Московские сезоны 2024</h1>
            <div class="container3"></div>
            <div class="description">
                <p>
                    Компания АО НТЦ "Техтелеком-АC" стала одной из первых компаний, которые приняли участие в программе “Московские сезоны” по растопке ледяных катков в Москве и Московской области.
                    В марте 2024 года, компания предоставила свои услуги на катках и ледовых аренах, что позволило обеспечить безопасность, комфорт и соблюдение сроков закрытия программы “Московские сезоны” 
                    В рамках программы, АО НТЦ "Техтелеком-AC" использовала передовые технологии и оборудование для растопки льда, а именно котлы наружного размещения мощностью 500кВт, весом 1500кг, размерами 258x130x190см (ДxШxВ).
                    В производстве котельных использовалось Итальянское оборудование. ПАКУ (портативная автоматизированная котельная установка) полностью 
                    автоматизирована, что позволяет управлять котельной удаленно, без постоянного присутствия обслуживающего персонала. После доставки ПАКУ на место установки подключение к коммуникациям и настройка занимает не более двух часов.
                    Это сделало возможным быстро и эффективно растопить лед на катках. Кроме того, компания провела обучение персонала по работе с оборудованием что, обеспечило качественно новый уровень экологической, производственной и пожарной безопасности при проведении работ.
                    Участие в программе “Московские сезоны” позволило АО НТЦ "Техтелеком-AC" укрепить свой имидж надежного партнера в области растопки льда в Москве и Московской области, а также получить новые заказы и контракты на будущее.
                </p>
            </div>
            <div class="more-container">
                <button class="more">Подробнее об установке</button>
            </div>
            <div class="container1"></div>
            <div class="container2"></div>
        </div>
        <div class="third-row">
            <div class="description">
                <div class="container4"></div>
                <p>ПАКУ 0,5 мВт 1К на базе котла Wiesberg Steel 501
                Новая блочно-модульная автоматизированная котельная наружного размещения</p><br>
                <p>Котельная установка разработана для отопления объектов, а также для растопки ледовых покрытий.</p><br>
                <p>ПАКУ 500 кВт полностью автоматизирована, что позволяет управлять котельной удаленно, без постоянного присутствия
                обслуживающего персонала.</p><br>
                <p>Эта модель котельной обладает высокой степенью эксплуатационной готовности.</p><br>
                <p>Особенность установки - наружное размещение. Котёл имеет небольшие габариты и малый вес, что позволяет устанавливать
                его в кузов грузового транспортного средства и работать непосредственно с него.</p><br>
                <p>Срок службы: Не менее 10 лет</p>
                <p>Масса ПАКУ: Не более 1500 кг</p>
            </div>
        </div>
        <div class="more-container">
            <button class="more">Подробнее об установке</button>
        </div>
        <div class="container1"></div>
        <div class="container2"></div>
    </div>
</template>

<script>
export default {
    name: 'NewsPage',
};
</script>

<style scoped>
.news {
    width: 1134px;
    display: flex;
    flex-direction: column; /* Вертикальное выравнивание */
    margin: 0 auto;
    justify-content: center;
    align-items: center;
}
.h1 {
    padding-bottom: 30px;
}
.p1 {
    padding-bottom: 42px;
    font-family: 'Inter', sans-serif; /* Применяем шрифт Inter */
    font-size: 30px; /* Размер шрифта 30 пикселей */
}
.h2 {
    padding-bottom: 30px;
}
.description {
    padding-top: 66px;
    padding-bottom: 63px;
    font-family: 'Inter', sans-serif; /* Применяем шрифт Inter */
    font-size: 30px; /* Размер шрифта 30 пикселей */
}
.more-container {
    display: flex;
    justify-content: center;
    padding-bottom: 60px; 
}
.more {
    width: 268px;
    height: 50px;
    background-color: black;
    color: white;
    border-color: black;
    font-family: 'Lato', sans-serif;
    font-weight: 540; 
    font-size: 20px;
}
.more:hover {
    background-color: #474a4d;
    border-color: #474a4d;
}
.more:active {
    background-color: #474a4d;
    border-color: #696770;
    color: white;
}
.container {
    background-image: url("/src/assets/images/container.svg");
    height: 660px;
    width: 1152px;
    background-size: cover;
}
.container1 {
    margin-top: 30px;
    background-image: url("/src/assets/images/twoline.svg");
    height: 2px;
    width: 769px;
    background-size: cover;
}
.container2 {
    background-image: url("/src/assets/images/3symbows.svg");
    background-size: cover;
    width: 122px;
    height: 40px;
}
.container3 {
    background-image: url("/src/assets/images/bluebox.png");
    background-size: cover;
    width: 1131px;
    height: 660px;
}
.container4 {
    background-image: url("/src/assets/images/blackbox.png");
    background-size: cover;
    width: 1128px;
    height: 660px;
}
</style>
